IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/RTI1_RTI1.xml
	<register id="RTI1_RTICAUC1" acronym="RTI1_RTICAUC1" offset="0x44" width="32" description="">
		<bitfield id="CAUC1" width="32" begin="31" end="0" resetval="0x0" description="CAUC1: Capture Up Counter 1.This registers captures the current value of the Up Counter 1 when a event occurs, controlled by the external capture control block. The read sequence has to be the same as with Up Counter 1 and Free Running Counter 1. So the RTICAFRC1 register has to be read first, before the RTICAUC1 register is read. This sequence ensures that the value of the RTICAUC1 register is the corresponding value to the RTICAFRC1 register, even if another capture event happens in between the two reads.User and privilege mode (read):value of Up Counter 1 on a capture event" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="RTI1_RTICOMP0" acronym="RTI1_RTICOMP0" offset="0x50" width="32" description="">
		<bitfield id="COMP0" width="32" begin="31" end="0" resetval="0x0" description="COMP0: Compare 0.This registers holds a compare value, which is compared with the counter selected in the compare control logic. If the Free Running Counter matches the compare value, an interrupt is flagged. With this register it is also possible to initiate a DMA request.User and privilege mode (read):current compare valuePrivilege mode (write):update of the compare register with a new compare valueNote: Reset behaviorA reset does not generate a compare match, since the compare logic will only be active, when the associated counter block is enabled." range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="RTI1_RTIUDCP0" acronym="RTI1_RTIUDCP0" offset="0x54" width="32" description="">
		<bitfield id="UDCP0" width="32" begin="31" end="0" resetval="0x0" description="UDCP0: Update Compare 0 Register.This registers holds a value, which is added to the value in the compare 0 register each time a compare matches. This gives the possibility to generate periodic interrupts without software intervention.User and privilege mode (read):value to be added to the compare 0 register on the next compare matchPrivilege mode (write):new update value" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="RTI1_RTICOMP1" acronym="RTI1_RTICOMP1" offset="0x58" width="32" description="">
		<bitfield id="COMP1" width="32" begin="31" end="0" resetval="0x0" description="COMP1: compare1.This registers holds a compare value, which is compared with the counter selected in the compare control logic. If the Free Running Counter matches the compare value, an interrupt is flagged. With this register it is also possible to initiate a DMA request.User and privilege mode (read):current compare valuePrivilege mode (write):update of the compare register with a new compare valueNote: Reset behaviorA reset does not generate a compare match, since the compare logic will only be active, when the associated counter block is enabled." range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="RTI1_RTIUDCP1" acronym="RTI1_RTIUDCP1" offset="0x5C" width="32" description="">
		<bitfield id="UDCP1" width="32" begin="31" end="0" resetval="0x0" description="UDCP1: Update compare1 Register.This registers holds a value, which is added to the value in the compare1 register each time a compare matches. This gives the possibility to generate periodic interrupts without software intervention.User and privilege mode (read):value to be added to the compare1 register on the next compare matchPrivilege mode (write):new update value" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="RTI1_RTICOMP2" acronym="RTI1_RTICOMP2" offset="0x60" width="32" description="">
		<bitfield id="COMP2" width="32" begin="31" end="0" resetval="0x0" description="COMP2: compare 2.This registers holds a compare value, which is compared with the counter selected in the compare control logic. If the Free Running Counter matches the compare value, an interrupt is flagged. With this register it is also possible to initiate a DMA request.User and privilege mode (read):current compare valuePrivilege mode (write):update of the compare register with a new compare valueNote: Reset behaviorA reset does not generate a compare match, since the compare logic will only be active, when the associated counter block is enabled." range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="RTI1_RTIUDCP2" acronym="RTI1_RTIUDCP2" offset="0x64" width="32" description="">
		<bitfield id="UDCP2" width="32" begin="31" end="0" resetval="0x0" description="UDCP2: Update compare 2 Register.This registers holds a value, which is added to the value in the compare 2 register each time a compare matches. This gives the possibility to generate periodic interrupts without software intervention.User and privilege mode (read):value to be added to the compare 2 register on the next compare matchPrivilege mode (write):new update value" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="RTI1_RTICOMP3" acronym="RTI1_RTICOMP3" offset="0x68" width="32" description="">
		<bitfield id="COMP3" width="32" begin="31" end="0" resetval="0x0" description="COMP3: compare 3.This registers holds a compare value, which is compared with the counter selected in the compare control logic. If the Free Running Counter matches the compare value, an interrupt is flagged. With this register it is also possible to initiate a DMA request.User and privilege mode (read):current compare valuePrivilege mode (write):update of the compare register with a new compare valueNote: Reset behaviorA reset does not generate a compare match, since the compare logic will only be active, when the associated counter block is enabled." range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="RTI1_RTIUDCP3" acronym="RTI1_RTIUDCP3" offset="0x6C" width="32" description="">
		<bitfield id="UDCP3" width="32" begin="31" end="0" resetval="0x0" description="UDCP3: Update compare 3 Register.This registers holds a value, which is added to the value in the compare 3 register each time a compare matches. This gives the possibility to generate periodic interrupts without software intervention.User and privilege mode (read):value to be added to the compare 3 register on the next compare matchPrivilege mode (write):new update value" range="31 - 0" rwaccess="RW"/>
	</register>
