IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/RTI1_RTI1.xml
	<register id="RTI1_RTITBLCOMP" acronym="RTI1_RTITBLCOMP" offset="0x70" width="32" description="">
		<bitfield id="TBLCOMP" width="32" begin="31" end="0" resetval="0x0" description="TBLCOMP: Timebase Low Compare Value.This value determines when the edge detection circuit starts monitoring the NTUx signal. It will be compared with Up Counter 0.User and privilege mode (read):current compare valuePrivilege mode (write when TBEXT = 0):the compare value is updatedPrivilege mode (write when TBEXT = 1):the compare value is not changedNote: Reset behaviorA reset does not generate a compare match." range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="RTI1_RTITBHCOMP" acronym="RTI1_RTITBHCOMP" offset="0x74" width="32" description="">
		<bitfield id="TBHCOMP" width="32" begin="31" end="0" resetval="0x0" description="TBHCOMP: Timebase High Compare Value.This value determines when the edge detection circuit will stop monitoring the NTUx signal. It will be compared with Up Counter 0.RTITBHCOMP has to be less than RTICPUC0, since RTIUC0 will be reset when RTICPUC0 is reached.Example:The NTUx edge detection circuit should be active +/- 10 RTICLK cycles around RTICPUC0.RTICPUC0 = 0x00000050RTITBLCOMP = 0x000046RTITBHCOMP = 0x00000009User and privilege mode (read):current compare valuePrivilege mode (write when TBEXT = 0):the compare value is updatedPrivilege mode (write when TBEXT = 1):the compare value is not changedNote: Reset behaviorA reset does not generate a compare match." range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="RTI1_RTISETINT" acronym="RTI1_RTISETINT" offset="0x80" width="32" description="">
		<bitfield id="RESERVED11" width="13" begin="31" end="19" resetval="0x0" description="Reserved.Reads return 0 and writes have no effect" range="31 - 19" rwaccess="RW"/> 
		<bitfield id="SETOVL1INT" width="1" begin="18" end="18" resetval="0x0" description="SETOVL1INT: Set Free Running Counter 1 Overflow Interrupt.User and privilege mode (read):0 = interrupt is disabled1 = interrupt is enabledPrivilege mode (write):0 = leaves the corresponding bit unchanged1 = enable interrupt" range="18" rwaccess="RW"/> 
		<bitfield id="SETOVL0INT" width="1" begin="17" end="17" resetval="0x0" description="SETOVL0INT: Set Free Running Counter 0 Overflow Interrupt.User and privilege mode (read):0 = interrupt is disabled1 = interrupt is enabledPrivilege mode (write):0 = leaves the corresponding bit unchanged1 = enable interrupt" range="17" rwaccess="RW"/> 
		<bitfield id="SETTBINT" width="1" begin="16" end="16" resetval="0x0" description="SETTBINT: Set Timebase Interrupt.User and privilege mode (read):0 = interrupt is disabled1 = interrupt is enabledPrivilege mode (write):0 = leaves the corresponding bit unchanged1 = enable interrupt" range="16" rwaccess="RW"/> 
		<bitfield id="RESERVED10" width="4" begin="15" end="12" resetval="0x0" description="Reserved.Reads return 0 and writes have no effect" range="15 - 12" rwaccess="RW"/> 
		<bitfield id="SETDMA3" width="1" begin="11" end="11" resetval="0x0" description="SETDMA3: Set Compare DMA Request 3.User and privilege mode (read):0 = DMA request is disabled1 = DMA request is enabledPrivilege mode (write):0 = leaves the corresponding bit unchanged1 = enable DMA request" range="11" rwaccess="RW"/> 
		<bitfield id="SETDMA2" width="1" begin="10" end="10" resetval="0x0" description="SETDMA2: Set Compare DMA Request 2.User and privilege mode (read):0 = DMA request is disabled1 = DMA request is enabledPrivilege mode (write):0 = leaves the corresponding bit unchanged1 = enable DMA request" range="10" rwaccess="RW"/> 
		<bitfield id="SETDMA1" width="1" begin="9" end="9" resetval="0x0" description="SETDMA1: Set Compare DMA Request 1.User and privilege mode (read):0 = DMA request is disabled1 = DMA request is enabledPrivilege mode (write):0 = leaves the corresponding bit unchanged1 = enable DMA request" range="9" rwaccess="RW"/> 
		<bitfield id="SETDMA0" width="1" begin="8" end="8" resetval="0x0" description="SETDMA0: Set Compare DMA Request 0.User and privilege mode (read):0 = DMA request is disabled1 = DMA request is enabledPrivilege mode (write):0 = leaves the corresponding bit unchanged1 = enable DMA request" range="8" rwaccess="RW"/> 
		<bitfield id="RESERVED9" width="4" begin="7" end="4" resetval="0x0" description="Reserved.Reads return 0 and writes have no effect" range="7 - 4" rwaccess="RW"/> 
		<bitfield id="SETINT3" width="1" begin="3" end="3" resetval="0x0" description="SETINT3: Set Compare Interrupt 3.User and privilege mode (read):0 = interrupt is disabled1 = interrupt is enabledPrivilege mode (write):0 = leaves the corresponding bit unchanged" range="3" rwaccess="RW"/> 
		<bitfield id="SETINT2" width="1" begin="2" end="2" resetval="0x0" description="SETINT2: Set Compare Interrupt 2.User and privilege mode (read):0 = interrupt is disabled1 = interrupt is enabledPrivilege mode (write):0 = leaves the corresponding bit unchanged1 = enable interrupt" range="2" rwaccess="RW"/> 
		<bitfield id="SETINT1" width="1" begin="1" end="1" resetval="0x0" description="SETINT1: Set Compare Interrupt 1.User and privilege mode (read):0 = interrupt is disabled1 = interrupt is enabledPrivilege mode (write):0 = leaves the corresponding bit unchanged1 = enable interrupt" range="1" rwaccess="RW"/> 
		<bitfield id="SETINT0" width="1" begin="0" end="0" resetval="0x0" description="SETINT0: Set Compare Interrupt 0.User and privilege mode (read):0 = interrupt is disabled1 = interrupt is enabledPrivilege mode (write):0 = leaves the corresponding bit unchanged1 = enable interrupt" range="0" rwaccess="RW"/>
	</register>
	<register id="RTI1_RTICLEARINT" acronym="RTI1_RTICLEARINT" offset="0x84" width="32" description="">
		<bitfield id="RESERVED14" width="13" begin="31" end="19" resetval="0x0" description="Reserved.Reads return 0 and writes have no effect" range="31 - 19" rwaccess="RW"/> 
		<bitfield id="CLEAROVL1INT" width="1" begin="18" end="18" resetval="0x0" description="CLEAROVL1INT: CLEAR Free Running Counter 1 Overflow Interrupt.User and privilege mode (read):0 = interrupt is disabled1 = interrupt is enabledPrivilege mode (write):0 = leaves the corresponding bit unchanged1 = disable interrupt" range="18" rwaccess="RW"/> 
		<bitfield id="CLEAROVL0INT" width="1" begin="17" end="17" resetval="0x0" description="CLEAROVL0INT: CLEAR Free Running Counter 0 Overflow Interrupt.User and privilege mode (read):0 = interrupt is disabled1 = interrupt is enabledPrivilege mode (write):0 = leaves the corresponding bit unchanged1 = disable interrupt" range="17" rwaccess="RW"/> 
		<bitfield id="CLEARTBINT" width="1" begin="16" end="16" resetval="0x0" description="CLEARTBINT: CLEAR Timebase Interrupt.User and privilege mode (read):0 = interrupt is disabled1 = interrupt is enabledPrivilege mode (write):0 = leaves the corresponding bit unchanged1 = disable interrupt" range="16" rwaccess="RW"/> 
		<bitfield id="RESERVED13" width="4" begin="15" end="12" resetval="0x0" description="Reserved.Reads return 0 and writes have no effect" range="15 - 12" rwaccess="RW"/> 
		<bitfield id="CLEARDMA3" width="1" begin="11" end="11" resetval="0x0" description="CLEARDMA3: CLEAR Compare DMA Request 3.User and privilege mode (read):0 = DMA request is disabled1 = DMA request is enabledPrivilege mode (write):0 = leaves the corresponding bit unchanged1 = disable DMA request" range="11" rwaccess="RW"/> 
		<bitfield id="CLEARDMA2" width="1" begin="10" end="10" resetval="0x0" description="CLEARDMA2: CLEAR Compare DMA Request 2.User and privilege mode (read):0 = DMA request is disabled1 = DMA request is enabledPrivilege mode (write):0 = leaves the corresponding bit unchanged1 = disable DMA request" range="10" rwaccess="RW"/> 
		<bitfield id="CLEARDMA1" width="1" begin="9" end="9" resetval="0x0" description="CLEARDMA1: CLEAR Compare DMA Request 1.User and privilege mode (read):0 = DMA request is disabled1 = DMA request is enabledPrivilege mode (write):0 = leaves the corresponding bit unchanged1 = disable DMA request" range="9" rwaccess="RW"/> 
		<bitfield id="CLEARDMA0" width="1" begin="8" end="8" resetval="0x0" description="CLEARDMA0: CLEAR Compare DMA Request 0.User and privilege mode (read):0 = DMA request is disabled1 = DMA request is enabledPrivilege mode (write):0 = leaves the corresponding bit unchanged1 = disable DMA request" range="8" rwaccess="RW"/> 
		<bitfield id="RESERVED12" width="4" begin="7" end="4" resetval="0x0" description="Reserved.Reads return 0 and writes have no effect" range="7 - 4" rwaccess="RW"/> 
		<bitfield id="CLEARINT3" width="1" begin="3" end="3" resetval="0x0" description="CLEARINT3: CLEAR Compare Interrupt 3.User and privilege mode (read):0 = interrupt is disabled1 = interrupt is enabledPrivilege mode (write):0 = leaves the corresponding bit unchanged1 = disable interrupt" range="3" rwaccess="RW"/> 
		<bitfield id="CLEARINT2" width="1" begin="2" end="2" resetval="0x0" description="CLEARINT2: CLEAR Compare Interrupt 2.User and privilege mode (read):0 = interrupt is disabled1 = interrupt is enabledPrivilege mode (write):0 = leaves the corresponding bit unchanged1 = disable interrupt" range="2" rwaccess="RW"/> 
		<bitfield id="CLEARINT1" width="1" begin="1" end="1" resetval="0x0" description="CLEARINT1: CLEAR Compare Interrupt 1.User and privilege mode (read):0 = interrupt is disabled1 = interrupt is enabledPrivilege mode (write):0 = leaves the corresponding bit unchanged1 = disable interrupt" range="1" rwaccess="RW"/> 
		<bitfield id="CLEARINT0" width="1" begin="0" end="0" resetval="0x0" description="CLEARINT0: CLEAR Compare Interrupt 0.User and privilege mode (read):0 = interrupt is disabled1 = interrupt is enabledPrivilege mode (write):0 = leaves the corresponding bit unchanged1 = disable interrupt" range="0" rwaccess="RW"/>
	</register>
	<register id="RTI1_RTIINTFLAG" acronym="RTI1_RTIINTFLAG" offset="0x88" width="32" description="">
		<bitfield id="RESERVED16" width="13" begin="31" end="19" resetval="0x0" description="Reserved.Reads return 0 and writes have no effect" range="31 - 19" rwaccess="RW"/> 
		<bitfield id="OVL1INT" width="1" begin="18" end="18" resetval="0x0" description="OVL1INT: Free Running Counter 1 Overflow Interrupt Flag.User and privilege mode (read):determines if an interrupt is pending0 = no interrupt pending1 = interrupt pendingPrivilege mode (write):0 = leaves the bit unchanged1 = set the bit to 0" range="18" rwaccess="RW"/> 
		<bitfield id="OVL0INT" width="1" begin="17" end="17" resetval="0x0" description="OVL0INT: Free Running Counter 0 Overflow Interrupt Flag.User and privilege mode (read):determines if an interrupt is pending0 = no interrupt pending1 = interrupt pendingPrivilege mode (write):0 = leaves the bit unchanged1 = set the bit to 0" range="17" rwaccess="RW"/> 
		<bitfield id="TBINT" width="1" begin="16" end="16" resetval="0x0" description="User and privilege mode (read):this flag is set when the TBEXT bit is cleared by detection of a missing external clockedge. It will not be set by clearing TBEXT by software.determines if an interrupt is pending0 = no interrupt pending1 = interrupt pendingPrivilege mode (write):0 = leaves the bit unchanged1 = set the bit to 0" range="16" rwaccess="RW"/> 
		<bitfield id="RESERVED15" width="12" begin="15" end="4" resetval="0x0" description="Reserved.Reads return 0 and writes have no effect" range="15 - 4" rwaccess="RW"/> 
		<bitfield id="INT3" width="1" begin="3" end="3" resetval="0x0" description="INT3: Interrupt Flag 3.User and privilege mode (read):determines if a interrupt is pending0 = no interrupt pending1 = interrupt pendingPrivilege mode (write):0 = leaves the bit unchanged1 = set the bit to 0" range="3" rwaccess="RW"/> 
		<bitfield id="INT2" width="1" begin="2" end="2" resetval="0x0" description="INT2: Interrupt Flag 2.User and privilege mode (read):determines if a interrupt is pending0 = no interrupt pending1 = interrupt pendingPrivilege mode (write):0 = leaves the bit unchanged1 = set the bit to 0" range="2" rwaccess="RW"/> 
		<bitfield id="INT1" width="1" begin="1" end="1" resetval="0x0" description="INT1: Interrupt Flag 1.User and privilege mode (read):determines if a interrupt is pending0 = no interrupt pending1 = interrupt pendingPrivilege mode (write):0 = leaves the bit unchanged1 = set the bit to 0" range="1" rwaccess="RW"/> 
		<bitfield id="INT0" width="1" begin="0" end="0" resetval="0x0" description="INT0: Interrupt Flag 0.User and privilege mode (read):determines if a interrupt is pending0 = no interrupt pending1 = interrupt pendingPrivilege mode (write):0 = leaves the bit unchanged1 = set the bit to 0" range="0" rwaccess="RW"/>
	</register>
	<register id="RTI1_RTIDWDCTRL" acronym="RTI1_RTIDWDCTRL" offset="0x90" width="32" description="">
		<bitfield id="DWDCTRL" width="32" begin="31" end="0" resetval="0x0" description="DWDCTRL: Digital Watchdog Control.User and priviledge mode (read):0x5312ACED = DWD counter is disabled. This is the default value.0xA98559DA = DWD counter is enabledAny other value = DWD counter state is unchanged (enabled or disabled)Priviledge mode (write):0xA98559DA = DWD counter is enabledAny other value = State of DWD counter is unchanged (stays enabled or disabled)Note: One-Write Functionality of DWDCTRL RegisterThe RTIDWDCTRL register implements a one-write functionality, such that the application cannot write to this registermore than once. Writing the default value will not enable the watchdog as described above. Writing the enable value will start the watchdog counters. A write to RTIDWDCTRL will only be enabled after a system reset again." range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="RTI1_RTIDWDPRLD" acronym="RTI1_RTIDWDPRLD" offset="0x94" width="32" description="">
		<bitfield id="RESERVED17" width="20" begin="31" end="12" resetval="0x0" description="Reserved.Reads return 0 and writes have no effect" range="31 - 12" rwaccess="RW"/> 
		<bitfield id="DWDPRLD" width="12" begin="11" end="0" resetval="0x0" description="DWDPRLD: Digital Watchdog Preload Value.User and priviledge mode (read):A read from this register in any CPU mode returns the current preload value.Priviledge mode (write):If the DWD is always enabled after reset is released:The DWD starts counting down from the reset value of the counter, that is, 0x002DFFFF. The application can configure the DWD preload register any time before this down counter expires.When the application services the DWD, the preload register contents are copied left-justified into the DWD down counter and it starts counting down from that value.If the DWD is implemented such that the down counter is enabled by software:The DWD preload register can be configured only when the DWD is disabled. Therefore, the application can only configure the DWD preload register before it enables the DWD down counter.The expiration time of the DWD Down Counter can be determined with following equation:texp = (RTIDWDPRLD+1) x 2 ^ 13 / RTICLK1where: RTIDWDPRLD = 0...4095" range="11 - 0" rwaccess="RW"/>
	</register>
	<register id="RTI1_RTIWDSTATUS" acronym="RTI1_RTIWDSTATUS" offset="0x98" width="32" description="">
		<bitfield id="RESERVED18" width="26" begin="31" end="6" resetval="0x0" description="Reserved.Reads return 0 and writes have no effect" range="31 - 6" rwaccess="RW"/> 
		<bitfield id="DWWD_ST" width="1" begin="5" end="5" resetval="0x0" description="DWWD ST: Windowed Watchdog Status.This bit denotes whether the time-window defined by the windowed watchdog configuration has been violated, or if a wrong key or key sequence was written to service the watchdog.User and priviledge mode (read):0 = no time-window violation has occurred.1 = a time-window violation has occurred. The watchdog will generate either a system reset or a non-maskable interrupt to the CPU in this case.Priviledge mode (write):0 = leaves the current value unchanged.1 = clears the bit to 0. This will also clear all other status flags in the RTIWDSTATUS register except for the AWD ST flag. Clearing of the status flags will deassert the non-maskable interrupt generated due to violation of the DWWD." range="5" rwaccess="RW"/> 
		<bitfield id="ENDTIMEVIOL" width="1" begin="4" end="4" resetval="0x0" description="END TIME VIOL: Windowed Watchdog End Time Violation Status.This bit denotes whether the end-time defined by the windowed watchdog configuration has been violated. This bit is effectively a copy of the DWD ST status flag.User and priviledge mode (read):0 = no end-time window violation has occurred.1 = the end-time defined by the windowed watchdog configuration has been violated.Priviledge mode (write):0 = leaves the current value unchanged.1 = clears the bit to 0." range="4" rwaccess="RW"/> 
		<bitfield id="STARTTIMEVIOL" width="1" begin="3" end="3" resetval="0x0" description="START TIME VIOL: Windowed Watchdog Start Time Violation Status. This bit denotes whether the start-time defined by the windowed watchdog configuration has been violated. This indicates that the WWD was serviced before the service window was opened.User and priviledge mode (read):0 = no start-time window violation has occurred.1 = the start-time defined by the windowed watchdog configuration has been violated.Priviledge mode (write):0 = leaves the current value unchanged.1 = clears the bit to 0." range="3" rwaccess="RW"/> 
		<bitfield id="KEYST" width="1" begin="2" end="2" resetval="0x0" description="KEYST: Watchdog KeyStatus.This bit denotes a reset generated by a wrong key or a wrong key-sequence written to the RTIWDKEY register.User and priviledge mode (read):0 = no wrong key or key-sequence written1 = wrong key or key-sequence written to RTIWDKEY registerPriviledge mode (write):0 = leaves the current value unchanged1 = clears the bit to 0" range="2" rwaccess="RW"/> 
		<bitfield id="DWDST" width="1" begin="1" end="1" resetval="0x0" description="DWDST: Digital Watchdog Status.This bit is effectively a copy of the END TIME VIOL status flag and is maintained for compatibility reasons.User and priviledge mode (read):0 = DWD timeout period not expired1 = DWD timeout period has expiredPriviledge mode (write):0 = leaves the current value unchanged1 = clears the bit to 0" range="1" rwaccess="RW"/> 
		<bitfield id="AWDST" width="1" begin="0" end="0" resetval="0x0" description="AWDST: Analog Watchdog Status.User and priviledge mode (read):0 = AWD pin 0 ?> 1 threshold not exceeded1 = AWD pin 0 ?> 1 threshold exceededPriviledge mode (write):0 = leaves the current value unchanged1 = clears the bit to 0" range="0" rwaccess="RW"/>
	</register>
