IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/RTI1_RTI1.xml
	<register id="RTI1_RTIWDKEY" acronym="RTI1_RTIWDKEY" offset="0x9C" width="32" description="">
		<bitfield id="RESERVED19" width="16" begin="31" end="16" resetval="0x0" description="Reserved.Reads return 0 and writes have no effect" range="31 - 16" rwaccess="RW"/> 
		<bitfield id="WDKEY" width="16" begin="15" end="0" resetval="0x0" description="WDKEY: Watchdog Key.User and privilege mode reads are indeterminate.Privilege mode (write):A write of 0xE51A followed by 0xA35C in two separate write operations defines the Key Sequence and discharges the watchdog capacitor. This also causes the upper 12 bits of the DWD down counter to be reloaded with the contents of the DWD preload register and the lower 13 bits to become all 1?s. Writing any other value causes a digital watchdog reset, as shown in Table 1-3.Note: Register write access time precautionThe user has to take into account that the write to the register takes 3 VCLK cycle. This needs to be considered for the AWD/DWD expiration calculation." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="RTI1_RTIDWDCNTR" acronym="RTI1_RTIDWDCNTR" offset="0xA0" width="32" description="">
		<bitfield id="RESERVED20" width="7" begin="31" end="25" resetval="0x0" description="Reserved.Reads return 0 and writes have no effect" range="31 - 25" rwaccess="RW"/> 
		<bitfield id="DWDCNTR" width="25" begin="24" end="0" resetval="0x0" description="DWDCNTR: Digital Watchdog Down Counter.The value of the DWDCNTR after a system reset is 0x002D_FFFF. When the DWD is enabled and the DWD counter starts counting down from this value with an RTICLK1 time base of 3MHz, a watchdog reset will be generated in 1 second.User and privilege mode (read):Reads return the current counter value.Privilege mode (write):Writes don?t have an effect." range="24 - 0" rwaccess="RW"/>
	</register>
	<register id="RTI1_RTIWWDRXNCTRL" acronym="RTI1_RTIWWDRXNCTRL" offset="0xA4" width="32" description="">
		<bitfield id="RESERVED21" width="28" begin="31" end="4" resetval="0x0" description="Reserved.Reads return 0 and writes have no effect" range="31 - 4" rwaccess="RW"/> 
		<bitfield id="WWDRXN" width="4" begin="3" end="0" resetval="0x0" description="WWDRXN: Digital Windowed Watchdog Reaction.User and privilege mode (read), privileged mode (write):0x5 = This is the default value. The windowed watchdog will cause a reset if the watchdog is serviced outside the time window defined by the configuration, or if the watchdog is not serviced at all.0xA = The windowed watchdog will generate a non-maskable interrupt to the CPU if the watchdog is serviced outside the time window defined by the configuration, or if the watchdog is not serviced at all.Writing any other value will cause a system reset if the watchdog is serviced outside the time window defined by the configuration, or if the watchdog is not serviced at all.Note: Configuration of DWWD ReactionThe DWWD reaction can be selected by the application even when the DWWD counter is already enabled.If a change to the WWDRXN is made before the watchdog service window is opened, then the change in the configuration takes effect immediately.If a change to the WWDRXN is made when the watchdog service window is already open, then the change in configuration takes effect only after the watchdog is serviced." range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="RTI1_RTIWWDSIZECTRL" acronym="RTI1_RTIWWDSIZECTRL" offset="0xA8" width="32" description="">
		<bitfield id="WWDSIZE" width="32" begin="31" end="0" resetval="0x0" description="WWDSIZE: Digital Windowed Watchdog Window Size.User and privilege mode (read), privileged mode (write):Value written to WWDSIZE    Window Size0x00000005                                   100% (Functionality same as the time-out digital watchdog.)0x00000050                                   50%0x00000500                                   25%0x00005000                                  12.5%0x00050000                                  6.25%0x00500000                                  3.125%Any other value                          3.125%Note: Incorrect value being written to watchdog window size control registerIf an incorerct value is written to the WWDSIZE field, or if a system disturbance causes the WWDSIZE field to have a value other than 0x5, 0x50, 0x500, 0x5000, 0x50000, or 0x500000, then the window size will be configured to be 3.125%. This increases the chances of getting a reset due to the windowed watchdog, which enables the system to handle the cause for the incorrect configuration.Note: Configuration of DWWD Window SizeThe DWWD window size can be selected by the application even when the DWWD counter is already enabled.If a change to the WWDSIZE is made before the watchdog service window is opened, then the change in the configuration takes effect immediately.If a change to the WWDSIZE is made when the watchdog service window is already open, then" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="RTI1_RTIINTCLRENABLE" acronym="RTI1_RTIINTCLRENABLE" offset="0xAC" width="32" description="">
		<bitfield id="RESERVED25" width="4" begin="31" end="28" resetval="0x0" description="Reserved.Reads return 0 and writes have no effect" range="31 - 28" rwaccess="RW"/> 
		<bitfield id="INTCLRENABLE3" width="4" begin="27" end="24" resetval="0x0" description="INTCLRENABLE3.Enables the auto-clear functionality on the compare 3 interrupt.User and Privileged mode (read):0x5 = Auto-clear for compare 3 interrupt is disabled.Any other value = Auto-clear for compare 3 interrupt is enabled.Privileged mode (write):0x5 = Disables the auto-clear functionality on the compare 3 interrupt.Any other value = Enables the auto-clear functionality on the compare 3 interrupt." range="27 - 24" rwaccess="RW"/> 
		<bitfield id="RESERVED24" width="4" begin="23" end="20" resetval="0x0" description="Reserved.Reads return 0 and writes have no effect" range="23 - 20" rwaccess="RW"/> 
		<bitfield id="INTCLRENABLE2" width="4" begin="19" end="16" resetval="0x0" description="INTCLRENABLE2.Enables the auto-clear functionality on the compare 2 interrupt.User and Privileged mode (read):0x5 = Auto-clear for compare 2 interrupt is disabled.Any other value = Auto-clear for compare 2 interrupt is enabled.Privileged mode (write):0x5 = Disables the auto-clear functionality on the compare 2 interrupt.Any other value = Enables the auto-clear functionality on the compare 2 interrupt." range="19 - 16" rwaccess="RW"/> 
		<bitfield id="RESERVED23" width="4" begin="15" end="12" resetval="0x0" description="Reserved.Reads return 0 and writes have no effect" range="15 - 12" rwaccess="RW"/> 
		<bitfield id="INTCLRENABLE1" width="4" begin="11" end="8" resetval="0x0" description="INTCLRENABLE1.Enables the auto-clear functionality on the compare 1 interrupt.User and Privileged mode (read):0x5 = Auto-clear for compare 1 interrupt is disabled.Any other value = Auto-clear for compare 1 interrupt is enabled.Privileged mode (write):0x5 = Disables the auto-clear functionality on the compare 1 interrupt.Any other value = Enables the auto-clear functionality on the compare 1 interrupt." range="11 - 8" rwaccess="RW"/> 
		<bitfield id="RESERVED22" width="4" begin="7" end="4" resetval="0x0" description="Reserved.Reads return 0 and writes have no effect" range="7 - 4" rwaccess="RW"/> 
		<bitfield id="INTCLRENABLE0" width="4" begin="3" end="0" resetval="0x0" description="INTCLRENABLE0.Enables the auto-clear functionality on the compare 0 interrupt.User and Privileged mode (read):0x5 = Auto-clear for compare 0 interrupt is disabled.Any other value = Auto-clear for compare 0 interrupt is enabled.Privileged mode (write):0x5 = Disables the auto-clear functionality on the compare 0 interrupt.Any other value = Enables the auto-clear functionality on the compare 0 interrupt." range="3 - 0" rwaccess="RW"/>
	</register>
