IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/RTI1_RTI1.xml
	<register id="RTI1_RTICOMP0CLR" acronym="RTI1_RTICOMP0CLR" offset="0xB0" width="32" description="">
		<bitfield id="COMP0CLR" width="32" begin="31" end="0" resetval="0x0" description="COMP0CLR: Compare 0 Clear.This registers holds a compare value, which is compared with the counter selected in the compare control logic. If the Free Running Counter matches the compare value, the compare 0 interrupt or DMA request line is cleared.User and privilege mode (read):current compare valuePrivilege mode (write):update of the compare register with a new compare valueNote: Reset behaviorA reset does not generate a compare match, since the compare logic will only be active, when the associated counter block is enabled." range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="RTI1_RTICOMP1CLR" acronym="RTI1_RTICOMP1CLR" offset="0xB4" width="32" description="">
		<bitfield id="COMP1CLR" width="32" begin="31" end="0" resetval="0x0" description="COMP1CLR: Compare 1 Clear.This registers holds a compare value, which is compared with the counter selected in the compare control logic. If the Free Running Counter matches the compare value, the Compare 1 interrupt or DMA request line is cleared.User and privilege mode (read):current compare valuePrivilege mode (write):update of the compare register with a new compare valueNote: Reset behaviorA reset does not generate a compare match, since the compare logic will only be active, when the associated counter block is enabled." range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="RTI1_RTICOMP2CLR" acronym="RTI1_RTICOMP2CLR" offset="0xB8" width="32" description="">
		<bitfield id="COMP2CLR" width="32" begin="31" end="0" resetval="0x0" description="COMP2CLR: Compare 2 Clear.This registers holds a compare value, which is compared with the counter selected in the compare control logic. If the Free Running Counter matches the compare value, the Compare 2 interrupt or DMA request line is cleared.User and privilege mode (read):current compare valuePrivilege mode (write):update of the compare register with a new compare valueNote: Reset behaviorA reset does not generate a compare match, since the compare logic will only be active, when the associated counter block is enabled." range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="RTI1_RTICOMP3CLR" acronym="RTI1_RTICOMP3CLR" offset="0xBC" width="32" description="">
		<bitfield id="COMP3CLR" width="32" begin="31" end="0" resetval="0x0" description="COMP3CLR: Compare 3 Clear.This registers holds a compare value, which is compared with the counter selected in the compare control logic. If the Free Running Counter matches the compare value, the Compare 3 interrupt or DMA request line is cleared.User and privilege mode (read):current compare valuePrivilege mode (write):update of the compare register with a new compare valueNote: Reset behaviorA reset does not generate a compare match, since the compare logic will only be active, when the associated counter block is enabled." range="31 - 0" rwaccess="RW"/>
	</register>
</module>